# Exercices XP Gold
DerniÃ¨re mise Ã  jour : 16 octobre 2024

## Ce que vous apprendrez
Effectuer la mise Ã  l'Ã©chelle et la normalisation des caractÃ©ristiques numÃ©riques dans l'ensemble de donnÃ©es Titanic.
CrÃ©ez de nouvelles fonctionnalitÃ©s composites dans lâ€™ensemble de donnÃ©es Titanic pour amÃ©liorer lâ€™analyse des donnÃ©es.
Appliquez la normalisation Min-Max aux colonnes Â« Ventes Â» et Â« BÃ©nÃ©fice Â» dans un ensemble de donnÃ©es de commerce Ã©lectronique.
AgrÃ©ger les mesures quotidiennes de la qualitÃ© de lâ€™air aux moyennes mensuelles.


## Ce que vous allez crÃ©er
Une version de l'ensemble de donnÃ©es Titanic avec les colonnes Â« Tarif Â» et Â« Ã‚ge Â» mises Ã  l'Ã©chelle et normalisÃ©es.
Un ensemble de donnÃ©es Titanic transformÃ© comprenant de nouveaux attributs composites tels que Â« Taille de la famille Â» et Â« IsAlone Â».
Une version de l'ensemble de donnÃ©es Titanic avec les colonnes Â« Ã‚ge Â» et Â« Tarif Â» normalisÃ©es Ã  l'aide de la normalisation Min-Max et Z-score.
Un ensemble de donnÃ©es sur les ventes de supermarchÃ©s avec les colonnes Â« Ventes Â» et Â« BÃ©nÃ©fice Â» normalisÃ©es Ã  l'aide de la normalisation Min-Max.
L'ensemble de donnÃ©es sur la qualitÃ© de l'air est regroupÃ© par emplacement et par mois, avec des mesures clÃ©s moyennes calculÃ©es pour chaque mois.

## Exercice 1 : Mise Ã  l'Ã©chelle et normalisation des donnÃ©es
Instructions
Identifiez les colonnes numÃ©riques dans l'ensemble de donnÃ©es telles que Â« Tarif Â» et Â« Ã‚ge Â».
Appliquer la normalisation (mise Ã  lâ€™Ã©chelle du score Z) aux fonctionnalitÃ©s avec une distribution gaussienne.
Appliquez la normalisation Min-Max aux fonctionnalitÃ©s qui nÃ©cessitent des plages dÃ©limitÃ©es.
Analyser lâ€™effet de la mise Ã  lâ€™Ã©chelle et de la normalisation sur les performances du modÃ¨le.
Astuce : utilisez StandardScaler et MinMaxScaler de scikit-learn.

### ðŸ“˜ Exercice 1 : Mise Ã  l'Ã©chelle et normalisation des donnÃ©es

In [1]:
# Cellule 1 : Import des librairies
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import StandardScaler, MinMaxScaler
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [2]:
# Cellule 2 : Chargement dâ€™un jeu de donnÃ©es (exemple : Titanic de seaborn)
df = sns.load_dataset("titanic")

# On affiche les premiÃ¨res lignes
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True